<?php
$students = [
    "นายธนวินท์ ปัถวี",
    "นายปภังกร ลาภาศุภวัฒน์",
    "นายพรพิพัฒน์ ตั้งวิโรจน์กุล",
    "นายภูมิฉัตร ปานทุ่ง",
    "นายไวภพ เพ็ญพันธ์นาค",
    "นายไอศูรย์ อนุศักดิ์ชัยกุล",
    "นายวรท วงศ์คงสวัสดิ์",
    "นายบึงพิพัฒน์ บึงไกร",
    "นายพัทธนันท์ ประยูร",
    "นายรุจิภาส แสงอ่อง",
    "นายสรวิชญ์ ศรีลาออน",
    "นายบุณยกร เฉลิมพรวิทิต",
    "นายชิษณุพงศ์ ถ้ำบุญรัฐเศรษฐ์",
    "นายสรยุทธ บุตรวงค์",
    "นายฐตวรรณ พงษ์พยัคฆ์",
    "นายจีรัชญ์ ขวัญแก้ว",
    "นายชยางกูร เชื้อเจริญ",
    "นายไชยพศ จัดเจนนาวี",
    "นายปองคุณ อนุกิตติรัตน์",
    "นายศรัณยพงศ์ เอกอัครพรพล",
    "นายรวิพล ฤกษ์สมบูรณ์ดี",
    "นายвиธวินท์ หอมอ่อน",
    "นายตรัยรัตน์ ประทีปคีรี",
    "นายธาวิน ลาภสมบัติศิริ",
    "นายวีรภัฏ หุณฑะสิริ",
    "นายจิรายุ ชัยปรีชา",
    "นายเอกราช ลุนณี",
    "นายสิรวิชญ์ ว่องกีรติกุล",
    "นายฐิติวัชร์ เลิศทักษิณานนท์",
    "นายเสฏพงศ์ สุวรรณวงศ์",
    "นายภคินธ์ ไชยเดช",
    "น.ส.ภณิตา พึ่งใจ",
    "น.ส.กาญจนา คชศิลา",
    "น.ส.พชรมน พลค้อ",
    "น.ส.ณัฐวิภา วงศ์ทองเครือ",
    "น.ส.ธิชานัน พลจอหอ",
    "น.ส.นันทิชา มาน้ำเที่ยง",
    "น.ส.อิษฎาอร โชคมงคลเสถียร",
    "น.ส.พิมพ์มาดา เที่ยงสั้น",
    "น.ส.สุวภัทร ปิงเมือง"
];

echo "<h2>รายชื่อนักเรียนห้อง 6/8 (ด้วย foreach loop)</h2>";
foreach ($students as $index => $name) {
    $no = $index + 1; 
    echo "เลขที่ $no : $name <br>";
}

echo "<hr>";

echo "<h2>รายชื่อนักเรียนห้อง 6/8 (ด้วย for loop)</h2>";
$total_students = count($students); 
for ($i = 0; $i < $total_students; $i++) {
    $no = $i + 1;
    echo "เลขที่ $no : " . $students[$i] . "<br>";
}

echo "<hr>";

echo "<h2>รายชื่อนักเรียนห้อง 6/8 (ด้วย while loop)</h2>";
$total_students = count($students);
$i = 0; 
while ($i < $total_students) {
    $no = $i + 1;
    echo "เลขที่ $no : " . $students[$i] . "<br>";
    $i++; 
?>